# Отчёт по лабораторной работе №2

## Выполнил:  Петраков Семён, группа 10 б

## Ссылки на репозитории:
1. Задание 1: [ссылка]()
2. Задание 2: [ссылка]()
3. Задание 3: [ссылка]()
4. Задание 4: [ссылка]()

## Задание 1. Консольные приложения в Repl.it

### Выполненные действия:
1. Создан репозиторий из шаблона
2. Проект импортирован в repl.it
3. Создана ветка development
4. Отредактирован файл Readme.md
5. Переименован файл hello.c в main.c
6. Настроен файл .replit для компиляции проекта
7. Обновлен .gitignore
8. Реализована программа для решения задачи варианта 23:
   - Нахождение количества чётных чисел в первой последовательности
   - Нахождение количества нечётных чисел во второй последовательности
   - Реализована функция проверки чётности числа

### Тестирование:
```
Тест 1:
Входные данные: 
Последовательность A: 1 2 3 4 5 6 7 8
Последовательность B: 9 10 11 12 13 14 15 16
Ожидаемый результат: 
Чётных в A: 4
Нечётных в B: 4
Фактический результат: 
Чётных в A: 4
Нечётных в B: 4
Тест пройден

Тест 2:
Входные данные: 
Последовательность A: 2 4 6 8 10 12 14 16
Последовательность B: 1 3 5 7 9 11 13 15
Ожидаемый результат: 
Чётных в A: 8
Нечётных в B: 8
Фактический результат: 
Чётных в A: 8
Нечётных в B: 8
Тест пройден
```

## Задание 2. Изучаем курс GitHub Actions: Hello World

### Выполненные действия:
1. Изучен курс "Hello GitHub Actions"
2. Создан публичный репозиторий tpmp-lab2-task2
3. Освоены основы работы с GitHub Actions
4. Создан простой workflow для тестирования работы GitHub Actions

## Задание 3. Используем структуры для представления данных

### Реализовано:
1. Создана структура AIRPLANE2 с полями:
   - Номер авиарейса
   - Время вылета
   - Время прилёта
   - Направление
   - Марка самолёта
   - Расстояние

2. Реализованы функции:
   - Создание массива из 12 записей об авиарейсах
   - Поиск авиарейса с максимальной скоростью
   - Вывод сведений по определённой марке самолёта
   - Поиск авиарейса с минимальным расстоянием
   - Подсчёт количества авиарейсов по направлениям

3. Создан Makefile для сборки проекта
4. Настроен GitHub Actions для автоматической сборки

### Тестирование:
```
Тест 1:
Входные данные: 12 тестовых записей авиарейсов
Ожидаемый результат: Корректное определение рейса с максимальной скоростью
Фактический результат: Функция верно определила рейс с max скоростью
Тест пройден

Тест 2:
Входные данные: Запрос информации по марке "Boeing 737"
Ожидаемый результат: Вывод всех рейсов на Boeing 737
Фактический результат: Выведены все соответствующие рейсы
Тест пройден
```

## Задание 4. Запись и чтение текстовых файлов

### Реализовано:
1. Создана структура для хранения данных об областях:
   - Название области
   - Областной центр
   - Население (общее, мужчины, женщины)
   - Площадь территории
   - Руководитель областной администрации

2. Реализованы функции:
   - Создание файла с данными
   - Чтение данных из файла
   - Фильтрация областей с населением < 1.2 млн
   - Сохранение результатов в новый файл

3. Организована структура проекта согласно модели КИС
4. Настроена автоматическая сборка через GitHub Actions

### Тестирование:
```
Тест 1:
Входные данные: Файл с данными 6 областей Беларуси
Ожидаемый результат: Фильтрация областей с населением < 1.2 млн
Фактический результат: Программа верно отфильтровала области
Тест пройден

Тест 2:
Входные данные: Пустой файл
Ожидаемый результат: Сообщение об отсутствии данных
Фактический результат: Выведено корректное сообщение
Тест пройден
```

## Ответы на контрольные вопросы:

1. Как организовать проект на языке C с использованием нескольких файлов?
   Ответ: Проект следует разделять на модули (исходные файлы .c) с соответствующими заголовочными файлами (.h). Каждый модуль должен выполнять определённую функциональность. Для сборки используется Makefile.

2. Какие преимущества даёт использование структур в языке C?
   Ответ: Структуры позволяют объединять логически связанные данные в единый тип, что улучшает читаемость кода, упрощает передачу сложных данных между функциями и делает код более поддерживаемым.

3. Как организовать чтение и запись текстовых файлов в языке C?
   Ответ: Для работы с файлами используются функции fopen(), fclose(), fprintf(), fscanf() и другие. Важно всегда проверять результат открытия файла и корректно закрывать файлы после работы.

4. Какие возможности предоставляет GitHub Actions?
   Ответ: GitHub Actions позволяет автоматизировать процессы сборки, тестирования и развёртывания приложений. Можно настраивать workflows, которые запускаются при определённых событиях (push, pull request и др.).

5. Как правильно организовать Makefile для проекта на C?
   Ответ: Makefile должен содержать правила для компиляции каждого исходного файла, линковки объектных файлов, а также цели для очистки и пересборки проекта. Важно указывать зависимости между файлами.
